{
    "research_areas": [
      {
        "title": "Computer Vision",
        "description": "Advancing state-of-the-art in visual perception systems through deep learning and neural networks. Our research focuses on object detection, scene understanding, and video analysis for real-world applications.",
        "key_topics": [
          "Object Detection and Recognition",
          "Scene Understanding",
          "Visual SLAM",
          "3D Vision"
        ],
        "image": "./res/compuert_vision.jpg"
      },
      {
        "title": "Explainable AI",
        "description": "Developing transparent and interpretable AI systems that can explain their decision-making processes. We focus on making complex AI models more understandable and trustworthy for end-users.",
        "key_topics": [
          "Model Interpretability",
          "Decision Explanation",
          "Transparent ML Systems",
          "AI Ethics"
        ],
        "image": "./res/xai.jpg"
      },
      {
        "title": "Natural Language Processing",
        "description": "Pushing boundaries in language understanding and generation through advanced neural architectures. Our work spans across text analysis, machine translation, and conversational AI.",
        "key_topics": [
          "Text Understanding",
          "Machine Translation",
          "Dialogue Systems",
          "Sentiment Analysis"
        ],
        "image": "./res/nlp.jpg"
      },
      {
        "title": "Reinforcement Learning",
        "description": "Investigating adaptive learning systems that can improve through interaction with their environment. We focus on developing efficient and robust RL algorithms for real-world applications.",
        "key_topics": [
          "Deep RL",
          "Multi-agent Systems",
          "Policy Optimization",
          "Robot Learning"
        ],
        "image": "./res/RL.jpg"
      },
      
      {
        "title": "Applied AI",
        "description": "Translating theoretical advances into practical solutions for real-world problems. We collaborate with industry partners to develop AI solutions for healthcare, robotics, and smart cities.",
        "key_topics": [
          "Healthcare AI",
          "Industrial Automation",
          "Smart Cities",
          "Robotics"
        ],
        "image": "./res/AI.jpg"
      },
      {
        "title": "Multi Modal Learning",
        "description": "Advancing AI systems that can seamlessly integrate and learn from multiple types of data inputs such as text, images, audio, and video. Our research focuses on developing models that can understand and process information across different modalities, leading to more robust and human-like AI systems.",
        "key_topics": [
          "Vision-Language Models",
          "Audio-Visual Processing",
          "Cross-Modal Fusion",
          "Multi-Sensor Integration",
          "Multi-Modal Transformers"
        ],
        "image": "./res/multi.jpg"
      }
    ]
  }