[
  {
    "title": "AlzheimerNet: An Effective Deep Learning Based Proposition for Alzheimer’s Disease Stages Classification From Functional Brain Changes in Magnetic Resonance Images",
    "doi": "10.1109/ACCESS.2023.3244952",
    "journal": "IEEE Access",
    "abstract": "Alzheimer’s disease is largely the underlying cause of dementia due to its progressive neurodegenerative nature among the elderly. The disease can be divided into five stages: Subjective Memory Concern (SMC), Mild Cognitive Impairment (MCI), Early MCI (EMCI), Late MCI (LMCI), and Alzheimer’s Disease (AD). Alzheimer’s disease is conventionally diagnosed using an MRI scan of the brain. In this research, we propose a fine-tuned convolutional neural network (CNN) classifier called AlzheimerNet, which can identify all five stages of Alzheimer’s disease and the Normal Control (NC) class. The ADNI database’s MRI scan dataset is obtained for use in training and testing the proposed model.",
    "link": "https://ieeexplore.ieee.org/document/10043854",
    "thumbnail": "./res/AlzheimerNet.png"
  },
  {
    "title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges",
    "doi": "10.1109/ACCESS.2024.3365742",
    "journal": "IEEE Access",
    "abstract": "Large Language Models (LLMs) recently demonstrated extraordinary capability in various natural language processing (NLP) tasks including language translation, text generation, question answering, etc. Moreover, LLMs are new and essential part of computerized language processing, having the ability to understand complex verbal patterns and generate coherent and appropriate replies in a given context. Though this success of LLMs has prompted a substantial increase in research contributions, rapid growth has made it difficult to understand the overall impact of these improvements.",
    "link": "https://ieeexplore.ieee.org/document/1043348",
    "thumbnail": "./res/AReviewonLargeLanguageModels.jpg"
  }
]